tutorials/combustion/fireFoam/les/smallPoolFire2D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet
    {

        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);

    }
    sides
    {
        type            pressureInletOutletVelocity;
        outletValue     uniform (0 0 0);
        value           uniform (0 0 0);
    }
    base
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0 0.05 0);
    }
    frontBack
    {
        type        empty;
    }
}

// ************************************************************************* //
