tutorials/combustion/fireFoam/les/smallPoolFire2D/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    outlet
    {
        type            buoyantPressure;
        value           uniform 101325;
    }

    sides
    {
        type            uniformDensityHydrostaticPressure;
        rho             1.2;
        pRefValue       101325;
        pRefPoint       (0 0 0);
        value           $internalField;
    }
    base
    {
        type            buoyantPressure;
        value           $internalField;
    }
    inlet
    {
        type            buoyantPressure;
        value           $internalField;
    }
    frontBack
    {
        type            empty;
    }
}

// ************************************************************************* //
